const express = require('express');
const router = express.Router();
const mongoose = require("mongoose");
const {Event} = require("../models/addEnter");


router.get('/', (req, res) => {


    (async () => {

        // Event.create({
        //     id: 1,
        //     name: 'День народження',
        //     prise: 1500,
        //     about: 'День народження — день, коли народилася певна особа, від цього дня починається відлік віку цієї особи.\n' +
        //         '\n' +
        //         'День народження більшість людей справляють як свято, оскільки у цей день людина стала на рік старша від попереднього дня народження. Людина, у якої цей день є днем народження, називається іменинником. У багатьох культурах іменинникам прийнято дарувати подарунки. День народження, який відбувається в річницю кратну 5-ти, 15, 20 і т. д. раз називають ювілеєм.[джерело?]\n' +
        //         '\n' +
        //         'Також, окремі люди святкують дні народження відомих особистостей, а християни святкують дні народження різних святих (наприклад, Різдво, Різдво Діви Марії тощо). Крім того, часто святкують іменини, тобто день ангела та святого покровителя, які часто збігаються з днем народження.',
        //     img: 'https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Birthday_cake.jpg/200px-Birthday_cake.jpg'
        // })
        // Event.create({
        //     id: 2,
        //     name: 'Івенти обирають люди покоління Z',
        //     prise: 2500,
        //     about: 'Покоління Z — люди, що народилися між кінцем 90-х та серединою нульових — скоро становитиме половину користувачів інтернету. Вони — інакші, зокрема і у своїх вподобаннях щодо заходів. Публікуємо колонку маркетинг-асистента Meeting Application Тетяни Баранової про те, як організувати івент, що зацікавить покоління Z.',
        //     img: 'https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Birthday_cake.jpg/200px-Birthday_cake.jpg'
        // })
        // Event.create({
        //     id: 3,
        //     name: 'Ефект присутності',
        //     prise: 3000,
        //     about: 'Майбутнє – за технологіями, що уможливлюють максимально скоротити дистанцію між спікерами, гостями та онлайн-глядачами. Що більшого ефекту присутності вдасться досягти, то шаленіший успіх чекає на захід. Дистанція між сценою і глядачами скорочується: аудиторія бере участь у вирішенні завдань, ставить запитання. Це стосується і офлайн-, і онлайн-учасників.',
        //     img: 'https://eventukraine.com/upload/storytelling.jpg'
        // })
        // Event.create({
        //     id: 4,
        //     name: 'Бути завжди онлайн',
        //     prise: 6000,
        //     about: 'Під час реалізації події щось може піти не за планом. До того ж, людям необхідно надати можливість ставити питання іншим учасникам або спікерам, ділитися матеріалами та враженнями. В цьому допомагають соціальні мережі, онлайн-канали та мобільні додатки. Останні все частіше використовуються на ринках інших країн.\n' +
        //         '\n' +
        //         'Власний додаток до конференції чи фестивалю — це турбота про інформованість аудиторії та підвищення статусу події. Відомі міжнародні фестивалі Tommorowland, Open’er Festival, Burning Man, а також українські Atlas Weekend, Файне Місто, Ulichnaya Eda та інші мають власні мобільні додатки, що допомагають гостям залишатися в курсі усіх змін та новин.',
        //     img: 'https://nachasi.com/wp-content/uploads/2019/03/image5.png'
        // })
        // Event.create({
        //     id: 5,
        //     name: 'Найкращий день у твоєму житі!',
        //     prise: 20000,
        //     about: 'Найщасливіший день у моєму життіЯкий день називають найщасливішим? Напевне, той день, коли відбулися важливі та цікаві події в житті. Це той день, який залишив в пам’яті найнезабутніші фрагменти, і пам’ять про них буде зберігатися дуже довго. Це день, події якого завжди радісно згадувати та розповідати.Одним із таких днів в моєму житті є той, коли ми з класом їздили на екскурсію в місто Білгород-Дністровський. Погода в цей день була пречудова. Рано-вранці ми, радісні та щасливі, зустрілися біля школи з нашою вчителькою. Кожен почав розповідати про те, як він готувався до екскурсії, і що цікавого з собою захопив. Всі взяли фотоапарати і вже біля школи почали робити перші кадри майбутнього фоторепортажу. Коли під’їхав автобус, ми всі дружно зайняли місця в салоні і познайомилися з провідником. Вона повідомила наш маршрут і пообіцяла розповідати про кожний населений пункт, який ми будемо проїжджати.',
        //     img: 'https://familytimes.com.ua/sites/default/files/styles/340/public/konkurs/xanastasiya_iolkina.jpg,qitok=-pKspu8u.pagespeed.ic.CbTCw4iLvl.jpg'
        // })
        // Event.create({
        //     id: 6,
        //     name: 'Досвід, яким хочеться ділитися',
        //     prise: 1500,
        //     about: 'Погодьтеся — на івенті хочеться не просто сидіти та слухати інших. Захід відбивається у пам’яті лише якщо активно береш участь у дискусіях, робиш щось власними руками або заводиш нові знайомства. Та й не тільки молоді люди цінують можливість бути дотичними до створення чогось нового. Таку можливість для киян створюють організатори фестивалю Кураж Базар.',
        //     img: 'https://nachasi.com/wp-content/uploads/2019/03/Znimok-ekrana-o-13.16.01-1024x570.png'
        // })


        let events = await Event.find({});
        res.send(events)

    })();

});

router.get('/:id', (req, res) => {


    (async () => {

        let event = await Event.findOne({id: req.params.id});
        res.send(event)

    })();

});


module.exports = router;
